[Killed] BlockStatement
src/CommitsAdapter.ts:21:26
       const result = await this.getCommits(this.octokit, url)
 
       return result
-    } catch (e: unknown) {
-      if (e instanceof Error) {
-        core.setFailed(e.message)
-      }
-      throw e
-    }
+    } catch (e: unknown) {}
   }
 
killedBy: CommitsAdapter should throw an error and call core.setFailed when the request fails
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/CommitsAdapter.ts:22:31
 
       return result
     } catch (e: unknown) {
-      if (e instanceof Error) {
-        core.setFailed(e.message)
-      }
+      if (e instanceof Error) {}
       throw e
     }
killedBy: CommitsAdapter should throw an error and call core.setFailed when the request fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request failed"

Number of calls: 0

[Killed] ObjectLiteral
src/CommitsAdapter.ts:34:16
     url: string
   ): Promise<Commit[] | undefined> {
     const result = await octokit.request(url, {
-      headers: {
-        'X-GitHub-Api-Version': '2022-11-28',
-        Authorization: `token ${this.token}`
-      }
+      headers: {}
     })
 
killedBy: CommitsAdapter should return commits when the request is successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "https://api.github.com/repos/user/repo/commits",
  Object {
-   "headers": Object {
