[Killed] EqualityOperator
src/IssuesAdapter.ts:35:28
       for (const repo of this.repositories) {
         let nextPage = await this.getIssues(octokit, repo, since, 1)
         result = result.concat(nextPage)
-        for (let page = 2; page < 100 && nextPage.length === 100; page++) {
+        for (let page = 2; page <= 100 && nextPage.length === 100; page++) {
           nextPage = await this.getIssues(octokit, repo, since, page)
           result = result.concat(nextPage)
killedBy: Real Issues API should fetch issues
statusReason: Error: expect(received).toBeGreaterThan(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined
